modm-ext/data.modm.io/docs/svd/header_stm32wba25xx.svd
        <register>
          <name>CHEP3R_ALT3</name>
          <description>USB Channel/Endpoint 3 register</description>
          <alternateRegister>CHEP3R</alternateRegister>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTXBD_COUNT_RX</name>
              <description>COUNT_RX[9:0] bits (Reception byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ERR_RX</name>
              <description>ERR_RX (Received error for an IN transaction)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_TX</name>
              <description>THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_RX</name>
              <description>THREE_ERR_RX[1:0] bits (Three errors for an IN transaction)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP3R_ALT4</name>
          <description>USB Channel/Endpoint 3 register</description>
          <alternateRegister>CHEP3R</alternateRegister>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTXBD_COUNT_TX</name>
              <description>COUNT_TX[9:0] bits (Transmission byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ERR_RX</name>
              <description>ERR_RX (Received error for an IN transaction)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_TX</name>
              <description>THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_RX</name>
              <description>THREE_ERR_RX[1:0] bits (Three errors for an IN transaction)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP4R</name>
          <description>USB Channel/Endpoint 4 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEVADDR</name>
              <description>DEVADDR[6:0] bits (Host mode)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK (Host mode)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LS_EP</name>
              <description>LS_EP (Low speed endpoint and host with HUB only)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR_TX</name>
              <description>ERR_TX (Received error for an OUT/SETUP transaction)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR_RX</name>
              <description>ERR_RX (Received error for an IN transaction)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_TX</name>
              <description>THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_RX</name>
              <description>THREE_ERR_RX[1:0] bits (Three errors for an IN transaction)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP4R_ALT1</name>
          <description>USB Channel/Endpoint 4 register</description>
          <alternateRegister>CHEP4R</alternateRegister>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRXBD_COUNT_TX</name>
              <description>COUNT_TX[9:0] bits (Transmission byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>TXRXBD_NUM_BLOCK</name>
              <description>NUM_BLOCK[4:0] bits (Number of blocks)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP4R_ALT2</name>
          <description>USB Channel/Endpoint 4 register</description>
          <alternateRegister>CHEP4R</alternateRegister>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRXBD_COUNT_RX</name>
              <description>COUNT_RX[9:0] bits (Reception byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>RXTXBD_NUM_BLOCK</name>
              <description>NUM_BLOCK[4:0] bits (Number of blocks)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP4R_ALT3</name>
          <description>USB Channel/Endpoint 4 register</description>
          <alternateRegister>CHEP4R</alternateRegister>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTXBD_COUNT_RX</name>
              <description>COUNT_RX[9:0] bits (Reception byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ERR_RX</name>
              <description>ERR_RX (Received error for an IN transaction)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_TX</name>
              <description>THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_RX</name>
              <description>THREE_ERR_RX[1:0] bits (Three errors for an IN transaction)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
