modm-ext/data.modm.io/docs/svd/header_stm32wba25xx.svd
        <register>
          <name>CHEP7R_ALT1</name>
          <description>USB Channel/Endpoint 7 register</description>
          <alternateRegister>CHEP7R</alternateRegister>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRXBD_COUNT_TX</name>
              <description>COUNT_TX[9:0] bits (Transmission byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>TXRXBD_NUM_BLOCK</name>
              <description>NUM_BLOCK[4:0] bits (Number of blocks)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP7R_ALT2</name>
          <description>USB Channel/Endpoint 7 register</description>
          <alternateRegister>CHEP7R</alternateRegister>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRXBD_COUNT_RX</name>
              <description>COUNT_RX[9:0] bits (Reception byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>RXTXBD_NUM_BLOCK</name>
              <description>NUM_BLOCK[4:0] bits (Number of blocks)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP7R_ALT3</name>
          <description>USB Channel/Endpoint 7 register</description>
          <alternateRegister>CHEP7R</alternateRegister>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTXBD_COUNT_RX</name>
              <description>COUNT_RX[9:0] bits (Reception byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ERR_RX</name>
              <description>ERR_RX (Received error for an IN transaction)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_TX</name>
              <description>THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_RX</name>
              <description>THREE_ERR_RX[1:0] bits (Three errors for an IN transaction)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEP7R_ALT4</name>
          <description>USB Channel/Endpoint 7 register</description>
          <alternateRegister>CHEP7R</alternateRegister>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EA</name>
              <description>EA[3:0] bits (endpoint/channel address)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STATTX</name>
              <description>STATTX[1:0] bits (Status bits, for transmission transfers)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGTX</name>
              <description>DTOGTX (Data toggle, for transmission transfers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTTX</name>
              <description>VTTX (Valid USB transaction transmitted)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPKIND</name>
              <description>EPKIND (endpoint/channel kind)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UTYPE</name>
              <description>UTYPE[1:0] bits (USB type of transaction)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP (Setup transaction completed)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATRX</name>
              <description>STATRX[1:0] bits (Status bits, for reception transfers)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTOGRX</name>
              <description>DTOGRX (Data Toggle, for reception transfers)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTRX</name>
              <description>VTRX (USB valid transaction received)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTXBD_COUNT_TX</name>
              <description>COUNT_TX[9:0] bits (Transmission byte count)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ERR_RX</name>
              <description>ERR_RX (Received error for an IN transaction)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_TX</name>
              <description>THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>THREE_ERR_RX</name>
              <description>THREE_ERR_RX[1:0] bits (Three errors for an IN transaction)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXRXBD_BLSIZE</name>
              <description>BLSIZE (Block size)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTR</name>
          <description>Control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USBRST</name>
              <description>USBRST (USB Reset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDWN</name>
              <description>PDWN (Power down)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPRDY</name>
              <description>SUSPRDY (Suspend state effective)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPEN</name>
              <description>SUSPEN (Suspend state enable)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L2RES</name>
              <description>L2RES (L2 remote wake-up / resume driver)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L1RES</name>
              <description>L1RES (L1 remote wake-up / resume driver)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L1REQM</name>
              <description>L1REQM (LPM L1 state request interrupt mask)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOFM</name>
              <description>ESOFM (Expected start of frame interrupt mask)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFM</name>
              <description>SOFM (Start of frame interrupt mask)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_DCONM</name>
              <description>RST_DCONM (USB reset request (Device mode) or device connect/disconnect (Host mode) interrupt mask)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPM</name>
              <description>SUSPM (Suspend mode interrupt mask)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPM</name>
              <description>WKUPM (Wake-up interrupt mask)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRM</name>
              <description>ERRM (Error interrupt mask)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMAOVRM</name>
              <description>PMAOVRM (Packet memory area over / underrun interrupt mask)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRM</name>
              <description>CTRM (Correct transfer interrupt mask)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THR512M</name>
              <description>THR512M (512 byte threshold interrupt mask)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISCM</name>
              <description>DDISCM (Device disconnection mask)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HOST</name>
              <description>HOST (HOST mode)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISTR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IDN</name>
              <description>IDN[3:0] bits (Device Endpoint / host channel identification number)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR (Direction of transaction)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L1REQ</name>
              <description>L1REQ (LPM L1 state request)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESOF</name>
              <description>ESOF (Expected start of frame)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF</name>
              <description>SOF (Start of frame)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST_DCON</name>
              <description>RST_DCON (USB reset request (Device mode) or device connect/disconnect (Host mode))</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>SUSP (Suspend mode request)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUP</name>
              <description>WKUP (Wake-up)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR (Error)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMAOVR</name>
              <description>PMAOVR (Packet memory area over / underrun)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTR</name>
              <description>CTR (Completed transfer in host mode)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THR512</name>
              <description>THR512 (512 byte threshold interrupt)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISC</name>
              <description>DDISC (Device connection)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCON_STAT</name>
              <description>DCON_STAT (Device connection status)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LS_DCON</name>
              <description>LS_DCON (Low speed device connected)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FNR</name>
          <description>Frame number register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FN</name>
              <description>FN[10:0] bits (Frame number)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>LSOF</name>
              <description>LSOF[1:0] bits (Lost SOF)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LCK</name>
              <description>LCK (Locked)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDM</name>
              <description>RXDM (Receive data - line status)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDP</name>
              <description>RXDP (Receive data + line status)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
